{"request_id": "324", "collection_ids": ["neuclir/1/all"], "background": "As an archaeologist leading an expedition in South America, I require insights into the \"Mysteries of Machu Picchu's Architecture\" to deepen our team's understanding of its construction techniques and historical significance. This report will guide our fieldwork and contribute to the scholarly discourse on Incan civilization.", "problem_statement": "Produce a report on the mysteries of Machu Picchu's architecture. The focus of the report is on speculations and theories regarding the construction methods and architectural marvels of Machu Picchu. I am also interested in hypotheses about the purpose, techniques, and significance of the unique structures at this ancient Incan site.", "limit": 2000, "title": "Machu Picchu, architecture"}
{"request_id": "361", "collection_ids": ["neuclir/1/all"], "background": "I write short articles in “Astronomy for All,” a magazine for the lay reader with an interest in astronomy and related subjects. Our readers take great interest in stories on the evolution of the solar system and, of course, the life within it. ", "problem_statement": "I am writing an article on recent discoveries about the Murchison meteorite. I am particularly interested in the composition of the meteorite, and how these new findings were achieved.", "limit": 2000, "title": "New findings Murchison meteorite"}
{"request_id": "387", "collection_ids": ["neuclir/1/all"], "background": "I am a high school student writing a report for an assignment about influential women in politics that will focus on Condoleezza Rice.", "problem_statement": "I need a report about Condoleezza Rice that focuses on her time in public service and that details specific statements or activities by her that either demonstrated her commitment to U.S. democratic values, showcased her efforts to promote democracy worldwide, or that had a significant impact on global affairs.", "limit": 2000, "title": "Condoleezza Rice Influence International Affairs"}
